{
  "Company Launches New Tech Practice": [
    "Legal communications and marketing firm Baretz+Brunelle has launched a NewLaw practice to advise law firms on ways to thrive in the modern marketplace. It will provide advice to law firms on evaluating opportunities for improvement, building and implementing new tools and processes, and helping them take that message to the market.",
    "LexisNexis and LegalTechJapan.com will jointly hold Japan’s first free legal tech hackathon, called Japan LawTech SOAR: Embracing Society 5.0​​​​​, in Tokyo, on November 9-10, to provide a platform where individuals can come together to explore and create solutions for lawyers and legal professionals to efficiently serve clients, improve internal operations, access legal knowledge and self-help legal solutions, and hande complex regulations.",
    "Tel-Aviv based startup Similari, has introduced its patent analysis service, which leverages AI to help identify and compare the unique ideas contained in various patent documents, in the U.S. to set itself apart from competitors and help legal teams monitor docket information on issued or pending patents.",
    "A group of legal and technology experts in South East Asia has launched the region’s first legal tech organization, called ASEAN Legal Tech Association (ALT), to harness the global impacts of technology on the law. The organization will focus on the countries of the Association of Southeast Asian Nations (ASEAN).",
    "StructureFlow, a startup providing visual representation of deal structures to lawyers, was declared winner of the Slaughter and May Collaborate incubator among finalists Tabled, Clarilis, JUST: Access, Logiak, and LitiGate.",
    "Deloitte has expanded its strategic alliance with Relativity to offer Trace, a compliance monitoring application, which will help clients to proactively detect and mitigate violations of industry regulations and organizational e-communication policies.",
    "Rocket Matter has updated its cloud-based practice management platform with the addition of business intelligence modules and customizable dashboards.",
    "Mo Ajaz, the Global Head of Legal Operations at National Grid, has launched an opensource network for the legal ecosystem, named LexOpenSource.com, to share learning on the business of law.",
    "Autto launched a business process automation solution so SME, legal and professional services firms can automate administrative tasks."
  ],

  "Company X Acquired Company Y": [
    "Case management company Filevine has acquired lead tracking and intake management company Lead Docket, to provide an end-to-end platform for legal professionals for intake, case management, document management, billing and timekeeping, and accounting.",
    "Digital media company Contxto has acquired Kurier, a legal startup from Recife for an undisclosed amount, to enter into the Brazilian legaltech market. Contxto plans to offers a data analytics platform so legal firms can monitor everything going on within the Brazilian justice system.",
    "Advanced, a provider of a SaaS-based platform that provides document management, IT outsourcing, cloud computing, and cybersecurity services for businesses, has announced the acquisition of legaltech company Tikit, a provider of practice and case management, time and billing, document lifecycle, and marketing and business development solutions from BT Group. The companies will jointly develop and provide innovative and specialist software solutions for the legal sector clients.",
    "Document technology company Litera has acquired Best Authority, a platform by Levit & James Inc that allows legal professionals to generate tables of authorities in legal briefs. The platform automatically finds and marks all the legal citations in a brief and generates a TOA for both litigators and transactional lawyers.",
    "Uptime Legal, a provider of technology services to law firms, has acquired digital law firm marketing agency Inbound Law Marketing, to deliver website design, proven SEO, and internet marketing services to help law firms grow their practices better.",
    "BarBooks, the Sydney based legal fintech company, has acquired barrister practice management product iChambers from TA Law, a provider of technology and services that enable barristers in securing work and enable practice management. The acquisition will foster international expansion in the UK and the USA, as well as diversification within the Australian legal market.",
    "Contract management service DocuSign has acquired Seal Software, a provider of contract management tools and analytics, discovery, and data extraction services, for $188 million in cash. DocuSign will integrate Seal’s analytics tools to enhance its ts DocuSign CLM offering.",
    "PracticeEvolve, a comprehensive legal practice management solution servicing mid-tier firms, has acquired Linetime legal software, a provider of legal matters, document, financial management, debt recovery, and online case management software, to expand its legal-tech product portfolio in the UK legal market.",
    "The practice management company Rocket Matter has acquired LexCharge, a payment processing company that specializes in handling payments for legal professionals. The LexCharge payment technology will be integrated within the Rocket Matter platform, to create a consolidated, streamlined experience for law firms for time capture, billing, invoicing, payments and financial monitoring.",
    "KLDiscovery, a provider of technology-enabled services and software for law firms, corporations, and government agencies, has acquired Superior Document Services, a provider of full-service eDiscovery and litigation support services, to deliver high-touch, personalized document, and eDiscovery services with quality control and security standards to clients."
  ],

  "Company X Hires Expert A": [
    "Emily Foges, the former CEO of legaltech company Luminance, has joined the Deloitte Legal team to support the company's existing legal managed services capabilities. The company plans to provide a multi-disciplinary offering across all stages of the contract lifecycle, from negotiation and data extraction to scale remediation, for tax, financial, risk, and cybersecurity advisory clients.",
    "ALSP/Law company Elevate has hired Brian Kuhn, the Founder and global leader of IBM Watson’s legal consulting practice, as the Vice President of its new Digital Strategy and Solutions business unit. The unit will focus on helping law departments and law firms capitalize on digital technologies including AI, machine learning, the cloud, and blockchain.",
    "The American Association of Law Libraries plans to feature startups and emerging companies in the legal information field through Start-Up Central, a dedicated space for companies to showcase their products and services to legal information professionals. The companies must have a product or service targeted for legal information and legal information professionals to showcase their solutions at Start-Up Central.",
    "Business advisory firm FTI Consulting has hired David Meadows as the Senior Managing Director for the firm’s technology arm. David will assist clients in cost and risk reduction through the use of e-discovery and FTI’s legal technological services. He will also be responsible for litigation preparedness, information lifecycle planning and implementations, data analytics, and computer forensics.",
    "Gateley Legal, a legal and professional services group, has hired Sarah Reynolds, former Head of Commercial Legal Services practice at RSM Legal, as a partner in the Commerce, Technology, and Media (CTM) team. Sarah will help with strategic sourcing and technology innovation to drive efficiency and enhance the client experience.",
    "The International Legal Technology Association (ILTA) has joined the Standards Advancement for the Legal Industry (SALI) Alliance, an independent, non-profit organization focused on facilitating a more transparent and efficient buying, selling and delivery of legal services, as one of the managing members. ILTA will assist SALI in building a matter standard for describing legal matters and foster innovation and provide consistency for buyers and sellers of legal services.",
    "Reynen Court, a legal technology platform backed by a group of 18 law firms, has hired Martin Levenglick, a Corporate Partner at the VLP Law Group in New York, as the Chief Legal Officer and Head of Corporate Development. Martin will assist in ongoing project work with law firms and application vendors to devise a new contracting model for the derivatives industry.",
    "Integreon has hired Jeffrey Catanzaro, former Vice President of Legal Business Solutions at UnitedLex, as the Senior VP of Contracts, Compliance, and Commercial Services. Jeffrey will lead Integreon’s LIBOR Transition Readiness Task Force, drive legal technology innovations like AI-based doc review, and forge partnerships for contract services clients.",
    "UK-based legal tech company Luminance has established a new advisory board, consisting of Steve Cooke, a Senior Partner at Slaughter and May, Rosemary Martin, a General Counsel at Vodafone, Manuela Cavallo, the Founding Partner Portolano Cavallo, and Vagn Thorup, the former chairman of the International Bar Association Technology Committee, to accelerate AI adoption.",
    "Tim Klem, a veteran product manager with experience in complex enterprise software systems, has joined Reynen Court to drive greater interoperability between and among third-party legal tech software applications."
  ],

  "Company X receives Investment": [
    "BRYTER, the no-code automation platform, has received $16 million in Series A round led by Dawn Capital and Accel. The company plans to accelerate international expansion, particularly in the US, and boost the adoption of no-code platforms.",
    "Legal AI knowledge management platform INTELLLEX has received $2.1 million funding in a round led by Quest Ventures, with participation from Thomson Reuters, Insignia Ventures, K3 Ventures, an unnamed Singapore government-backed VC fund. The company plans to develop a knowledge management system that automates the taxonomy-based classification of documents with contextual search capabilities.",
    "SirionLabs, a developer of AI-powered enterprise contract lifecycle management technology, has received $44 million in a Series C round led by Tiger Global and Avatar Growth Capital, with participation from Sequoia Capital India. The company plans to further develop its AI-based contract lifecycle management platform.",
    "NLP-driven contract review solution provider LawGeex has received $20 million in a funding round led by Palo Alto-based VC fund Corner Ventures, with participation from Aleph, lool Ventures, Tom Glocer, and the La Maison fund. The company aims to launch NLP/machine learning software to read, analyze, and help improve contracts at the review/negotiation phase.",
    "Qorus, a provider of sales enablement and proposal management platforms, has completed a $5 million financing round led by WestRiver Group. The funding will enable the company in sales enablement, and accelerate the development of a Proposal Management platform, to provide law firms the ability to consistently automate proposals and produce RFPS and bids.",
    "Malbek, a provider of cloud modern contract lifecycle management (CLM) software, has closed a $3m funding round led by Osage Venture Partners. The company plans to invest in product innovation, including AI and advanced technologies, grow sales and marketing, and add to its customer experience team.",
    "AI and legal technology platform provider LexCheck has closed a $3 million seed financing round led by Kli Capital, with participation from Howard Morgan and Vivek Garipalli. The company intends to use the funds to expand its business internationally and accelerate the automation of contract negotiations.",
    "Data-intelligence and legal technology platform Bodhala has received $10 million in an investment round led by growth equity firm Edison Partners. The company will use the funds for product expansion to help companies analyze, interpret, and optimize outside counsel spend, and sales and market acceleration.",
    "Dutch legaltech startup Bluetick, which provides an online search engine for lawyers, has received $228K in a pre-seed round from henQ Capital and ASIF Ventures. The company plans to improve its legal search algorithm for more intuitive find and search through legal documents, such as jurisprudence.",
    "Toronto-based Blue J Legal, a provider of AI-powered software to predict legal outcomes in areas of U.S. tax law, has received $1.4 million in growth capital financing from CIBC Innovation Banking to expand geographically and expanding into new product segments."
  ]
}
